<?php

return [
    'title.required' => 'Поле "Название" обязательно.',
    'title.max' => 'Поле "Название" не должно превышать 255 символов.',

    'description.max' => 'Поле "Описание" не должно превышать 255 символов.',

    'image.image' => 'Файл должен быть изображением.',
    'image.max' => 'Максимальный размер изображения — 2 МБ.',

    'place.integer' => 'Поле "Место" должно быть целым числом.',

    'for_all.boolean' => 'Поле "Для всех" должно быть логическим значением.',
    'system.boolean' => 'Поле "Системный" должно быть логическим значением.',
];
