<?php

return [
    'title.required' => 'Поле "Название группы критериев" обязательно для заполнения.',
    'title.max' => 'Название группы критериев не должно превышать 255 символов.',

    'criteria.array' => 'Критерии должны быть в виде массива.',

    'criteria.*.title.required_with' => 'Поле "Название критерия" обязательно, если указаны критерии.',
    'criteria.*.title.max' => 'Название критерия не должно превышать 255 символов.',

    'criteria.*.max_score.numeric' => 'Максимальный балл критерия должен быть числом.',
];
